###### Add extra comma at the end of each line, but NOT at the end of last line

In [1]:
s = "member_id, tag_name, detail_name, detail_value, \
abc123, m1, Service_A, 20, \
abc123, m1, Service_B, 20, \
abc123, m2, Service_C, 10, \
xyz456, m3, Service A, 5, \
xyz456, m3, Service A, 10"

In [2]:
s

'member_id, tag_name, detail_name, detail_value, abc123, m1, Service_A, 20, abc123, m1, Service_B, 20, abc123, m2, Service_C, 10, xyz456, m3, Service A, 5, xyz456, m3, Service A, 10'

In [3]:
s_list = s.split(",")
s_list

['member_id',
 ' tag_name',
 ' detail_name',
 ' detail_value',
 ' abc123',
 ' m1',
 ' Service_A',
 ' 20',
 ' abc123',
 ' m1',
 ' Service_B',
 ' 20',
 ' abc123',
 ' m2',
 ' Service_C',
 ' 10',
 ' xyz456',
 ' m3',
 ' Service A',
 ' 5',
 ' xyz456',
 ' m3',
 ' Service A',
 ' 10']

In [4]:
out = []
n = 4
for i in range(0, len(s_list), n):
    lst = s_list[i:i+n]
    stripped = list(map(str.strip, lst))
    out.append(lst)
    print(lst)

['member_id', ' tag_name', ' detail_name', ' detail_value']
[' abc123', ' m1', ' Service_A', ' 20']
[' abc123', ' m1', ' Service_B', ' 20']
[' abc123', ' m2', ' Service_C', ' 10']
[' xyz456', ' m3', ' Service A', ' 5']
[' xyz456', ' m3', ' Service A', ' 10']

In [5]:
out

[['member_id', ' tag_name', ' detail_name', ' detail_value'],
 [' abc123', ' m1', ' Service_A', ' 20'],
 [' abc123', ' m1', ' Service_B', ' 20'],
 [' abc123', ' m2', ' Service_C', ' 10'],
 [' xyz456', ' m3', ' Service A', ' 5'],
 [' xyz456', ' m3', ' Service A', ' 10']]

In [6]:
import  pandas as pd


df = pd.concat([pd.Series(x) for x in out], axis=1)
# df = pd.DataFrame([sub.split(",") for sub in out])
df

               0           1           2           3           4           5
0      member_id      abc123      abc123      abc123      xyz456      xyz456
1       tag_name          m1          m1          m2          m3          m3
2    detail_name   Service_A   Service_B   Service_C   Service A   Service A
3   detail_value          20          20          10           5          10

In [7]:
df= df.transpose()
# df = df.T
df

           0          1             2              3
0  member_id   tag_name   detail_name   detail_value
1     abc123         m1     Service_A             20
2     abc123         m1     Service_B             20
3     abc123         m2     Service_C             10
4     xyz456         m3     Service A              5
5     xyz456         m3     Service A             10

In [8]:
list(df.columns.values)

[0, 1, 2, 3]

In [9]:
# new_df = df.copy()
# new_df[new_df.columns[1:]] = ''
# new_df

df1 = df.to_csv(header=None,index=False)
type(df1)

str

In [11]:
df1

'member_id, tag_name, detail_name, detail_value\r\n abc123, m1, Service_A, 20\r\n abc123, m1, Service_B, 20\r\n abc123, m2, Service_C, 10\r\n xyz456, m3, Service A, 5\r\n xyz456, m3, Service A, 10\r\n'

In [12]:
data = df1#input_string
df = pd.DataFrame([x.split(',') for x in data.split('\r\n')])
df

           0          1             2              3
0  member_id   tag_name   detail_name   detail_value
1     abc123         m1     Service_A             20
2     abc123         m1     Service_B             20
3     abc123         m2     Service_C             10
4     xyz456         m3     Service A              5
5     xyz456         m3     Service A             10
6                  None          None           None

In [19]:
# print(df.to_string(header=False))
# df.to_string(header=False)
# df = df.to_string(header=False)
# df

'  member_id   tag_name   detail_name   detail_value\n     abc123         m1     Service_A             20\n     abc123         m1     Service_B             20\n     abc123         m2     Service_C             10\n     xyz456         m3     Service A              5\n     xyz456         m3     Service A             10'

In [10]:
# df = pd.DataFrame(df.values)
df.columns = range(len(df.columns))
df

           0          1             2              3
0  member_id   tag_name   detail_name   detail_value
1     abc123         m1     Service_A             20
2     abc123         m1     Service_B             20
3     abc123         m2     Service_C             10
4     xyz456         m3     Service A              5
5     xyz456         m3     Service A             10

In [11]:
df.set_index(pd.Index(['']*len(df)), inplace=True)
df

          0          1             2              3
  member_id   tag_name   detail_name   detail_value
     abc123         m1     Service_A             20
     abc123         m1     Service_B             20
     abc123         m2     Service_C             10
     xyz456         m3     Service A              5
     xyz456         m3     Service A             10

In [12]:
df.reset_index()
# df.drop(df.head(1).index, inplace=True)
df

          0          1             2              3
  member_id   tag_name   detail_name   detail_value
     abc123         m1     Service_A             20
     abc123         m1     Service_B             20
     abc123         m2     Service_C             10
     xyz456         m3     Service A              5
     xyz456         m3     Service A             10

In [59]:
df.reset_index(drop=True, inplace=True)
df.head(1)

           0          1             2              3
0  member_id   tag_name   detail_name   detail_value

In [58]:
df.index.name

In [55]:
# https://stackoverflow.com/questions/70167026/convert-csv-data-to-nested-json
result = []

for member_id, member_df in df.groupby('member_id'):
    member_dict = {'member_id': member_id}
    member_dict['tag'] = []
    for tag_name, tag_df in member_df.groupby('tag_name'):
        tag_dict = {'tag_name': tag_name}
        tag_dict['detail'] = []
        for detail_name, detail_df in tag_df.groupby('detail_name'):
            detail_dict = {'detail_name': detail_name}
            detail_dict['detail_value'] = detail_df.detail_value.mean() # should be only one value, taking 'mean' just in case
            tag_dict['detail'].append(detail_dict)
        member_dict['tag'].append(tag_dict)
    result.append(member_dict)

print(json.dumps(result, indent=4))

KeyError: 'member_id'